app/controllers/dogs_controller.rb

SELECT  "dogs".* FROM "dogs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @page = params.fetch(:page, 0).to_i
    @dogs = Dog.offset(@page * DOGS_PER_PAGE).limit(DOGS_PER_PAGE)

UPDATE "dogs" SET "updated_at" = ? WHERE "dogs"."id" = ?  [["updated_at", "2021-08-14 23:35:05.214614"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @dog.update(dog_params)

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_dog
      @dog = Dog.find(params[:id])