app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Speck"], ["description", "Just a dog"], ["created_at", "2021-08-14 21:54:34.097665"], ["updated_at", "2021-08-14 21:54:34.097665"]]
---
  def create
    @dog = Dog.new(dog_params)

    respond_to do |format|
      if @dog.save

UPDATE "dogs" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["name", "Speck"], ["description", ""], ["updated_at", "2021-08-14 21:54:34.190515"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @dog.update(dog_params)

DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 1]]
---
  def destroy
    @dog.destroy

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_dog
      @dog = Dog.find(params[:id])